jonathan-shc/UWB/ports/esp32-idf/sdkconfig.defaults
# ESP32-S3 target; 16 MB flash (N16R8). PSRAM left off for Phase 1 (engine hot
# buffers belong in internal SRAM anyway).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 1 kHz tick so k_msleep(ms) has 1 ms granularity (default 100 Hz = 10 ms).
CONFIG_FREERTOS_HZ=1000

# The codec allocates + the DS-TWR bring-up runs on the main task.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
